Core/src/src/Documents/СчетФактураОтправленныйГрузия/СчетФактураОтправленныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураОтправленныйГрузия</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.АвансыОтправленныхФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКорректировки</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <type>
      <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.Взаимозачет</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/CommonModules/AzRyРаботаСДокументамыКлиентСервер/Module.bsl
#Область ЧекККМ

Функция ПолучитьИтоги(Документ) Экспорт
		
	Структура = Новый Структура;
	Структура.Вставить("Всего", 		Документ.Запасы.Итог("Всего"));	
	Структура.Вставить("СуммаНДС", 		Документ.Запасы.Итог("СуммаНДС"));
	Структура.Вставить("СуммаДокумента", Структура.Всего - Структура.СуммаНДС);
	
	Возврат Структура;
	
КонецФункции

Функция СформироватьНадписьСчетФактураОтправленный(НайденныйСчетФактура, СчетФактураТекст="", Контрагент) Экспорт

	КомпонентыЭН = Новый Массив;
	КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Счет фактура документ: '; ka = 'ანგარიშფაქტურა (გაგზავნილი) დოკუმენტი: '; en = 'Tax Document: '")));
	
	Если ЗначениеЗаполнено(НайденныйСчетФактура) Тогда
		Если ТипЗнч(НайденныйСчетФактура) = Тип("Структура") Тогда
			СчетФактураТекст = СтрЗаменить(НайденныйСчетФактура.Ссылка, НСтр("ru='Счет фактура документ: ';ka='ანგარიშფაქტურა (გაგზავნილი) დოკუმენტი: '"),"№");
		КонецЕсли;
		СчетФактураТекст = СтрЗаменить(СчетФактураТекст, НСтр("ka='(წაშლილია)';ru=' (удален)'"),"");
		СчетФактураТекст = СтрЗаменить(СчетФактураТекст, НСтр("ka='(არ არის გატარებული)';ru=' (не проведен)'"),"");
		
		КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(СчетФактураТекст, , , , НСтр("ka='გახსნა';ru='открыть';en='open'")));
	Иначе
		Если Не ЗначениеЗаполнено(Контрагент) Или Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
			КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ka='შექმნა';ru='создать';en='create'"), , , , НСтр("ka='შექმნა';ru='создать';en='create'")));
		Иначе 
			КомпонентыЭН.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Контрагент не является плательщиком НДС'; ka = 'კონტრაგენტი არ არის დღგ-ს გადამხდელი'")));
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(КомпонентыЭН);

КонецФункции

Функция КонтрагентНалогообложениеНДС(Контрагент) Экспорт

	Если Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		Возврат Истина;	
	Иначе 
		Возврат Ложь;
	КонецЕсли;	

КонецФункции
 
#КонецОбласти


#Область РС_ЭлектроннаяНакладная

Функция СоздатьСчетФактуру(ДокументыОснования, ЭлектроннаяНакладная) Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("Ошибка", Ложь);
	Ответ.Вставить("ТекстОшибки", "");
		
	Для каждого ДокументСсылка Из ДокументыОснования Цикл
		Если ДокументСсылка.Контрагент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда			
			Док = Документы.СчетФактураОтправленныйГрузия.СоздатьДокумент();
			Док.Дата = ЭлектроннаяНакладная.Дата;
			Док.Заполнить(ДокументСсылка);
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Ответ.Вставить("Ошибка", Истина);
				Ответ.Вставить("ТекстОшибки", "ანგარიშფაქტურის შექმნისას მოხდა შეცდომა! დოკუმენტის ავტომატური დაგენერირება ვერ მოხდა. მიზეზი:  " + ОписаниеОшибки());
			КонецПопытки;		
		КонецЕсли; 	
	КонецЦикла;
	 
	Возврат Ответ;
	
КонецФункции

#КонецОбласти


#Область СчетФактураОтправленныйГрузия

Функция ОснованиеСуществует(ДокументыОснования) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыОснования.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыОснования.ДокументОснование В(&ДокументОснование)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументыОснования);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество() > 0;
	
КонецФункции

Процедура ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения, ДокументыОснования) Экспорт
	
	ЭтотОбъект.Автор		= ПараметрыСеанса.ТекущийПользователь;
	ЭтотОбъект.Контрагент	= ДанныеЗаполнения.Контрагент;
	ЭтотОбъект.Договор		= ДанныеЗаполнения.Контрагент.ДоговорПоУмолчанию;
	ЭтотОбъект.Организация	= ДанныеЗаполнения.Организация;
	ЭтотОбъект.ДатаВходящегоДокумента = ДанныеЗаполнения.Дата;
		
	НоваяСтрока = ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснование = ДанныеЗаполнения.Ссылка;
	НоваяСтрока.Всего = ДанныеЗаполнения.Запасы.Итог("Всего") + ?(ТипЗнч(НоваяСтрока.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"), ДанныеЗаполнения.Работы.Итог("Всего"), 	0);
	НоваяСтрока.СуммаНДС = ДанныеЗаполнения.Запасы.Итог("СуммаНДС") + ?(ТипЗнч(НоваяСтрока.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"), ДанныеЗаполнения.Работы.Итог("СуммаНДС"),	0);
	НоваяСтрока.СуммаДокумента = НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
	
КонецПроцедуры

// Заполняет запасы документа из данных заполнения
// 
// Параметры:
//	ДанныеЗаполнения - Массив - Заданные данные заполнения
//	
// Возвращаемое значение:
//	
//	
Процедура ЗаполнитьЗапасы(ЭтотОбъект, ДокументСсылка) Экспорт
	
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		КЧ = Новый КвалификаторыЧисла(12,3);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , КЧ);
		
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
		ОписаниеТиповН = Новый ОписаниеТипов(Массив, , ,);
		
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ОписаниеТиповХ = Новый ОписаниеТипов(Массив, , ,);
		
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерения"));
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
		ОписаниеТиповЕИ = Новый ОписаниеТипов(Массив, , ,);
		
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("Номенклатура", ОписаниеТиповН);
		Таблица.Колонки.Добавить("Характеристика", ОписаниеТиповХ);
		Таблица.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТиповЕИ);
		Таблица.Колонки.Добавить("Количество", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Цена", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
		Таблица.Колонки.Добавить("СуммаНДС", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Всего", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Вид", ОписаниеТиповЧ);
		//Для Каждого ДокументСсылка Из ДанныеЗаполнения Цикл
			
			//Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
				Для Каждого ТЗ Из ДокументСсылка.Запасы Цикл
					НоваяСтрока = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);			
					//Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
					//	НоваяСтрока.Вид = -1; 
					//Иначе
						НоваяСтрока.Вид = 1;
					//КонецЕсли;
				КонецЦикла;
			//КонецЕсли;
			
			//Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			//	Для Каждого ТЗ Из ДокументСсылка.Работы Цикл
			//		НоваяСтрока = Таблица.Добавить();
			//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);			
			//		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
			//		НоваяСтрока.Вид = 1;
			//	КонецЦикла;
			//КонецЕсли;
			//
			//Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			//	Для Каждого ТЗ Из ДокументСсылка.РаботыИУслуги Цикл
			//		НоваяСтрока = Таблица.Добавить();
			//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);			
			//		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
			//		НоваяСтрока.Вид = 1;
			//	КонецЦикла;
			//КонецЕсли;
			
		//КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Номенклатура,
		               |	Таблица.Характеристика,
		               |	Таблица.Количество,
		               |	Таблица.Цена,
		               |	Таблица.Сумма,
		               |	Таблица.СтавкаНДС,
		               |	Таблица.СуммаНДС,
		               |	Таблица.Всего,
		               |	Таблица.Вид,
		               |	Таблица.ЕдиницаИзмерения
		               |ПОМЕСТИТЬ Запасы
		               |ИЗ
		               |	&Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Запасы.Номенклатура,
		               |	Запасы.Характеристика,
		               |	Запасы.СтавкаНДС,
		               |	Сумма(Запасы.Количество * Запасы.вид) Как Количество ,
		               |	СУММА(Запасы.Всего * Запасы.Вид) / Сумма(Запасы.Количество * Запасы.вид) Как Цена,
		               |	СУММА(Запасы.СуммаНДС * Запасы.Вид) КАК СуммаНДС,
		               |	СУММА((Запасы.Всего - Запасы.СуммаНДС) * Запасы.Вид) КАК Сумма,
		               |	СУММА(Запасы.Всего * Запасы.Вид) КАК Всего,
		               |	Запасы.ЕдиницаИзмерения
		               |ИЗ
		               |	Запасы КАК Запасы
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Запасы.Номенклатура,
		               |	Запасы.Характеристика,
		               |	Запасы.Цена,
		               |	Запасы.СтавкаНДС,
		               |	Запасы.ЕдиницаИзмерения";
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		ЭтотОбъект.Запасы.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;		
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
